charles8051/periphery/src/Periphery.Treehopper/firmware/Treehopper-EFM8/src/descriptors.c
/*******************************************************************************
 * @file descriptors.c
 * @brief USB descriptors.
 *******************************************************************************/
//=============================================================================
// src/descriptors.c: generated by Hardware Configurator
//
// This file is only generated if it does not exist. Modifications in this file
// will persist even if Configurator generates code. To refresh this file,
// you must first delete it and then regenerate code.
//=============================================================================
//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <si_toolchain.h>
#include <endian.h>
#include <stdlib.h>
#include <string.h>
#include <efm8_usb.h>
#include "descriptors.h"
#include "serialNumber.h"
#ifdef __cplusplus
extern "C" {
#endif

SI_SEGMENT_VARIABLE(deviceDesc[],
		const USB_DeviceDescriptor_TypeDef,
		SI_SEG_CODE) =
{
	USB_DEVICE_DESCSIZE,             // bLength
	USB_DEVICE_DESCRIPTOR,// bLength
	htole16(0x0200),// bcdUSB
	0xFF,// bDeviceClass
	0,	 // bDeviceSubClass
	0,	 // bDeviceProtocol
	64,	 // bMaxPacketSize
	USB_VENDOR_ID,// idVendor
	USB_PRODUCT_ID,// idProduct
	htole16(0x0115),// bcdDevice (276 -> 277 = v2.76 -> v2.77: EP_PeripheralConfig stream framing
	                // #170 - the desync drain, the bounded identity write, the marker written last,
	                // and the supply monitor armed before a flash write. A 2.76 board executes
	                // pixel data as commands on the abort path and a 2.77 board does not, which is
	                // the whole reason this word exists.
	                //
	                // Bumped WITH the source change, not with the release, and deliberately so.
	                // The previous entry (275 -> 276: MCU watchdog #226, EP0 vendor rescue reset
	                // #227, SOF-gated watchdog feed #233) records the cost of the other order:
	                // those three landed on top of the v2.75 release without a bump, so a 2.75
	                // board could be the released image or any of them and version-gating could
	                // not tell a board that self-resets from one that does not. The same thing
	                // happened again on 2026-09-04 while reproducing #170 on the bench: two
	                // connected boards both reported the same version, one of them turned out not
	                // to match dist/Treehopper.hex at all, and telling them apart took rebooting a
	                // board into its bootloader to run a flash verify. dist/ not being regenerated
	                // yet is exactly when this matters - an unreleased image is already on a board.)
	1,// iManufacturer
	2,// iProduct
	3,// iSerialNumber
	1,// bNumConfigurations
};

SI_SEGMENT_VARIABLE(configDesc[],
		const uint8_t,
		SI_SEG_CODE) =
{
	USB_CONFIG_DESCSIZE,             // bLength
	USB_CONFIG_DESCRIPTOR,// bLength
	0x2E,// wTotalLength(LSB)
	0x00,// wTotalLength(MSB)
	1,	 // bNumInterfaces
	1,	 // bConfigurationValue
	0,	 // iConfiguration

	CONFIG_DESC_BM_RESERVED_D7 |// bmAttrib: Self powered
	CONFIG_DESC_BM_SELFPOWERED,

	CONFIG_DESC_MAXPOWER_mA(100),// bMaxPower: 100 mA

	//Interface 0 Descriptor
	USB_INTERFACE_DESCSIZE,// bLength
	USB_INTERFACE_DESCRIPTOR,// bDescriptorType
	0,// bInterfaceNumber
	0,// bAlternateSetting
	4,// bNumEndpoints
	255,// bInterfaceClass: Vendor Specific
	255,// bInterfaceSubClass
	255,// bInterfaceProtocol
	0,// iInterface

	  //Endpoint 1 IN Descriptor
	USB_ENDPOINT_DESCSIZE,// bLength
	USB_ENDPOINT_DESCRIPTOR,// bDescriptorType
	0x81,// bEndpointAddress
	USB_EPTYPE_BULK,// bAttrib
	0x40,// wMaxPacketSize (LSB)
	0x00,// wMaxPacketSize (MSB)
	1,	 // bInterval

		 //Endpoint 2 IN Descriptor
	USB_ENDPOINT_DESCSIZE,// bLength
	USB_ENDPOINT_DESCRIPTOR,// bDescriptorType
	0x82,// bEndpointAddress
	USB_EPTYPE_BULK,// bAttrib
	0x40,// wMaxPacketSize (LSB)
	0x00,// wMaxPacketSize (MSB)
	1,	 // bInterval

		 //Endpoint 1 OUT Descriptor
	USB_ENDPOINT_DESCSIZE,// bLength
	USB_ENDPOINT_DESCRIPTOR,// bDescriptorType
	0x01,// bEndpointAddress
	USB_EPTYPE_BULK,// bAttrib
	0x40,// wMaxPacketSize (LSB)
	0x00,// wMaxPacketSize (MSB)
	1,	 // bInterval

		 //Endpoint 2 OUT Descriptor
	USB_ENDPOINT_DESCSIZE,// bLength
	USB_ENDPOINT_DESCRIPTOR,// bDescriptorType
	0x02,// bEndpointAddress
	USB_EPTYPE_BULK,// bAttrib
	0x40,// wMaxPacketSize (LSB)
	0x00,// wMaxPacketSize (MSB)
	1,	 // bInterval
};

#define LANG_STRING   htole16( SLAB_USB_LANGUAGE )
#define MFR_STRING                             "Treehopper"
#define PROD_STRING                            "Treehopper USB"

LANGID_STATIC_CONST_STRING_DESC(langDesc[], LANG_STRING);
UTF16LE_PACKED_STATIC_CONST_STRING_DESC(mfrDesc[], MFR_STRING);
UTF16LE_PACKED_STATIC_CONST_STRING_DESC(prodDesc[], PROD_STRING);
//SI_LOCATED_VARIABLE_NO_INIT( nameDesc[64], USB_StringDescriptor_TypeDef,
//		SI_SEG_CODE, NAME_ADDR);
//SI_LOCATED_VARIABLE_NO_INIT( serDesc[64], USB_StringDescriptor_TypeDef,
//		SI_SEG_CODE, SER_ADDR);
//-----------------------------------------------------------------------------
SI_SEGMENT_POINTER(myUsbStringTable_USEnglish[],
		static const USB_StringDescriptor_TypeDef,
		const SI_SEG_CODE) =
{
	langDesc,
	mfrDesc,
	serialNumber_name,
	serialNumber_serial,
	serialNumber_name

};

//-----------------------------------------------------------------------------
SI_SEGMENT_VARIABLE(initstruct,
		const USBD_Init_TypeDef,
		SI_SEG_CODE) = { deviceDesc,                         // deviceDescriptor
		configDesc,                                         // configDescriptor
		myUsbStringTable_USEnglish,                         // stringDescriptors
		sizeof(myUsbStringTable_USEnglish) / sizeof(void *)   // numberOfStrings
};

#ifdef __cplusplus
}
#endif

